["# 1.2.0 (June 19th, 2023)","- gSender runs noticeably faster and lighter!","- There were multiple areas where we were able to make file processing on average 20% more efficient and reduce overall program memory usage by an average of 2/3rds due to an increased node sandbox memory size and improvements to multiple run times","- On files that still take a while to load we’ve now added a loading bar window to show file loading progress","- Added new job recovery functionality","- In specific instances where your machine's USB port disconnects from gSender during a job it’ll be able to recommend where you should restart from","- Updates to gamepad controller support","- List of officially tested controllers if you’d like to select a gamepad that works more reliably with gSender","- Tested controllers come with their own pre-loaded presets","- Improved UI for creating controller profiles","- Available PDF printout of shortcuts to hang up near your machine","- Better support for Laser Diodes","- Optional low-power laser enable on outlining","- Laser-specific visualization: there’s a different style when laser mode is on and that colour can be customized","- Bug fix: Laser offset now allows for negative offset values","- New Diagnostic tab inside the Calibrate Tool","- See at-a-glance information on whether your limit switches, touch probe, or other pins are activated","- General summary on your CNCs firmware settings","- The ability to generate a Diagnostic PDF file that includes information on your computer, CNC, recent alarms / errors, any currently loaded g-code file, and more! Very handy to share with our support team or other CNCers to help diagnose problems your CNC might be experiencing","- Remote Mode, control your CNC remotely!","- Connect to your CNC from a myriad of other internet-connected devices for loading files from other computers or jogging and zeroing from your phone","- Easy to set up and configure","- Tool changing is now more fully supported by our new Wizard","- gSender already recognized M0 and M6 commands to initialize a pause in the middle of a file","- New processes to support using the ‘paper method’, a touch plate, or a tool length sensor (choose based on your CNC setup) now allow more flexibility in handling tool changing and in some cases can pop up a Wizard to direct you through each step and without the need for custom macros","- Other assorted features","- Slider overrides for easier feed rate and spindle / laser adjustment on the fly","- Ability to toggle between job overrides and file attributes before starting a job to fine-tune feed and speed overrides before starting a job","- Get a top-down snapshot image of your job with the new SVG Visualizer that bridges the gap between a fully disabled visualizer or the full 3D one (useful for less powerful computers)","- Colour coded Console on certain commands like alarms and errors that can also now pop-out","- Assorted other settings","- New safety tab for tracking alarms and errors and accessing safety settings","- Soft limit warning on file load if machine has limit switches","- Customizable probe fail distance in Z","- More visualization theme customizations for ‘light’, ‘dark’, or your own fully custom design","- New Shortcuts for controlling Probing, Visualization, and Macros and the ability to filter shortcuts by category to easily find and edit them","- New stats tab for tracking jobs run on your CNC","- Custom decimal places on the DRO","- and other bug fixes for Linux auto updates, Settings exporting, Preferred units and file unit modals, Bounding box relative movement, Shortcut printing and more!","### 1.1.7 (October 26th, 2022)","- Fix for XYZ probe profile when $13 enabled","- Fix for machine position overflowing bounds","- Fix for some keybinds no longer recognizing when they were released","### 1.1.6 (October 19th, 2022)","- Improved surfacing tool - pattern now ramps in to support more surfacing bit types, cut direction is reversible, able to start from center, can copy gcode to clipboard for saving.","- Major improvements to visualizer memory usage and parsing speed","- Start from line should account for maximum file Z height when moving into position to account for situations where Z0 is set at the spoilboard.","- Probe code should always return to exact starting location instead of approximating it.","- Improvements to firmware flashing UX - can now select profile and port inside tool.","- Fix for auto-probe code movements being too small when \"$13 report as inches\" EEPROM value enabled","- Go To buttons only use safe height if below that position when limit switches enabled to avoid moving downwards.","- Fixed values in some machine profiles.","- Added machine state guards to some keyboard shortcuts.","- UI Modals now more difficult to close accidentally.","- Bracket Comments on M0/M1 now emitted to UI.","- Laser offsets preferences allow negative values again","- Bounding Box variables once again available to macros","- Mac version now exits completely on close.","- Higher UI clarity when connecting to board with invalid/unrecognizable firmware","- Styling changes in Firmware Tool","- Fixed overflow when OS had screen zoom above 100%.","### 1.1.4 (August 26th, 2022)","* Fixed firmware tool control for setting $23","* Flashing again available without connecting to device","* Improvements to continuous jogging (thanks @cotepat)","* Fixed issue with some settings not properly persisting","* Outline tool improvements - moved to worker thread, G0 movements included, tweaks to accuracy","* More accurate file length estimates when connected - virtualizer now uses EEPROM acceleration values","* Probe function now available in manual tool change","* Better datafilter for invalid UTF8/UTF16 characters"]