["# ![gSender logo](https://github.com/Sienci-Labs/sender/blob/master/src/app/images/icon-git.png?raw=true)gSender: connect to and control [Grbl](https://github.com/grbl/grbl)-based CNCs\r","\r","gSender is a feature-packed CNC interface software designed to be clean and easy to learn while retaining a depth of capabilities for advanced users. Its development was begun out of a passion for hobby CNC machines: an interface rebuilt to suit the needs of the at-home CNC user.\r","* Accepts standard, GRBL-compliant g-code and has been verified to work with many of the common CAM programs\r","* Began development to bring new concepts to the existing landscape of GRBL senders in an effort to advance functionality and ease-of-use\r","* Javascript-based CNC interface software which leverages [Electron](https://www.electronjs.org/) for cross platform use\r","* Is a branch off of the popular [CNCjs CNC controller interface](https://github.com/cncjs/cncjs) \r","\r","Some things that we’re looking to accomplish with this sender:\r","* Reliability of operation\r","* Accommodates all ranges of computing systems (low-end PC to RasPi | ‘light mode’)\r","* Clean and easy to use no matter your previous CNC experience\r","* Makes available all normally expected functions\r","* Addresses common error throwing conditions automatically\r","* Built-in gadgets for surface probing, stock flattening, firmware editing, and g-code editing with syntax highlighting, command navigation, and more\r","* 3D cutting visualization\r","\r","![gSender](https://resources.sienci.com/wp-content/uploads/2021/04/gSender-main-page-machine-interface-850x479.png)\r","\r","## 💻 Download [![Github All Releases](https://img.shields.io/github/downloads/Sienci-Labs/gsender/total.svg)]()\r","\r","gSender is available for the following systems and does not yet support headless Pi operation\r","| ![Windows](https://github.com/EgoistDeveloper/operating-system-logos/blob/master/src/48x48/WIN.png)<br>Windows (x32) | ![Windows](https://github.com/EgoistDeveloper/operating-system-logos/blob/master/src/48x48/WIN.png)<br>Windows (x64) | ![Mac](https://github.com/EgoistDeveloper/operating-system-logos/blob/master/src/48x48/MAC.png)<br>Mac (Intel) | ![Linux](https://github.com/EgoistDeveloper/operating-system-logos/blob/master/src/48x48/LIN.png)<br>Linux | ![RasPi](https://github.com/iiiypuk/rpi-icon/blob/master/48.png)<br>Ras Pi\r","|-|-|-|-|-\r"," ``` Available ```[EXE](https://github.com/Sienci-Labs/gsender/releases/download/v1.1.0/gSender-1.1.0-windows-x86.exe) | ``` Available ``` [EXE](https://github.com/Sienci-Labs/gsender/releases/download/v1.1.0/gSender-1.1.0-windows-x64.exe) | ``` Available ``` [DMG](https://github.com/Sienci-Labs/gsender/releases/download/v1.1.0/gSender-1.1.0.dmg) | ``` Available ``` [DEB](https://github.com/Sienci-Labs/gsender/releases/download/v1.1.0/gSender_1.1.0_amd64.deb) | ``` Available ``` [ApIm](https://github.com/Sienci-Labs/gsender/releases/download/v1.1.0/gSender-1.1.0-armv7l.AppImage)\r","\r","[Check out the latest releases here.](https://github.com/Sienci-Labs/gsender/releases/)\r","\r","\r","## 📦 Current Features\r","\r","* [GRBL](https://github.com/gnea/grbl/releases) controllers supported\r","* Smart machine connection\r","* 3-axis digital readout (DRO) with manual value entry\r","* All-directional jogging with XY diagonals, jog presets, and incremental/continuous single-button handling\r","* Zero-setting and gotos (independent and combined)\r","* Probing in any direction plus safe continuity detection ensures no broken cutting tools\r","* Full imperial/metric compatibility\r","* Responsive screen design and workspace customizations including visualizer light and dark theme\r","* 3D toolpath visualization (no machine connection required)\r","* File insight on load (feed range, spindle range, tools used, estimated cutting time, and overall, max, and min dimensions)\r","* Feed override and active job status indicators\r","* Fully exposed keyboard shortcuts for external keyboard/keypad control\r","* Joystick support built-in for a variety of controllers\r","* Safe height movements - accommodates machines with or without endstops\r","* Homing cycle and quick-movement locations available for machines with homing hardware\r","* Full spindle/laser support via manual control widgets, active alerting, and live overrides\r","* Full mist/flood coolant support via manual control widgets and active alerting\r","* Macros buttons (rearrangeable) with enhanced macro variables and individually assignable keyboard shortcuts\r","* Lightweight mode reduces processing intensity on less powerful hardware or when running larger files\r","* Easy workspace swapping for more advanced jigging or alignment work\r","* Optional automatic handling for common error throwing g-code\r","* Firmware tool for easier GRBL EEPROM changes, loading defaults, and GRBL flashing\r","* Surfacing tool auto-generates surfacing g-code based on machine cutting area and other preferences, ready to execute\r","* Calibration tool for axis alignment - a step by step process to make sure your CNC is square\r","* Movement tuning tool for calibrating motor axis movements\r","* Tool change functionality - pause, ignore, or run code blocks on M6 commands\r","* Start-from-line functionality to resume jobs part-way through in case of failure of abort\r","* Outline functionality indicates the rough bounds of the job before cutting\r","* Customizable g-code injection at job start & end\r","* Tooltips for data entry points\r","* Alarm warning explanations to better contextualize CNC errors\r","* Sleep management to keep PC awake during g-code sending\r","* Pre-built machine profiles, including:\r","    - LongMill\r","    - Shapeoko\r","    - X-carve \r","    - OpenBuilds CNCs\r","    - 3018 CNC & PROVer\r","    - BobsCNC CNCs\r","    - CNC4Newbie CNCs\r","    - Mill Right CNCs\r","    - Ooznest WorkBee\r","    - Nomad\r","    - Carvey\r","    - Mill One, and more...\r","\r","## 🎓 Documentation\r","\r","All up-to-date documentation on gSender can be found here: [https://sienci.com/gsender-documentation/](https://sienci.com/gsender-documentation/)\r","\r","If you encounter issues or would like to recommend improvements for gSender, there's a link for feedback submission on the documentation page. We also have a place for discussion on our forum: [https://forum.sienci.com/c/gsender/](https://forum.sienci.com/c/gsender/)\r","\r","\r","## 📃 Example Files\r","\r","If you'd like to test gSender's capabilities, there are several gcode files in the [examples](https://github.com/Sienci-Labs/sender/tree/master/examples) directory that can be downloaded and run locally.\r","\r","\r","## 💼 License\r","\r","gSender is free software, provided as-is and available under the [GNU GPLv3 license](https://github.com/Sienci-Labs/sender/blob/master/LICENSE).\r","\r","\r","## 👓 Further Use\r","\r","gSender is also designed in a way that it can be run locally on your computer browser or otherwise compiled for use on other systems which aren't listed in the downloads. There will soon be documentation on how you can set this up yourself listed below once there's been a bit more testing completed.\r","\r","\r","## 🕣 Development History\r","\r","### 1.1.0 (June 24th, 2022)\r","* Fix for start g-code event not sending entire code block in some situations and make it more consistent in all situations\r","* Firmware now highlights settings that are different from default for Sienci machines\r","* Support for edge/beta channels for those who want to opt into new features for testing\r","* Improvements to controller movement using joystick\r","* Brighter cut lines in visualizer\r","* More sensible timeout on fetching updates\r","* MK2 12X30 configuration now properly selectable\r","* Added Mist, flood, and stop coolant keyboard shortcuts\r","* Fixed issue with surfacing spiral pattern where center strip could be missed with some parameters\r","* Fixed issue in calibration where the direction it asked you to move gantries wasn't correct in some situations.\r","* Laser offset no longer resets to previous value on toggle of laser mode\r","* Numerous surfacing tooltip and unit conversion issues fixed\r","* Surfacing now lets you select M3 or M4 movement\r","* Rapid position buttons now use $27 pulloff value for determining final positions\r","* Outline tool now stores and restores modals on completion \r","* Improvements to settings storage and persistence\r","* Migrated from Electron 10 to Electron 18\r","\r"]