["### 1.4.10 (October 28, 2024)","- Jog no longer sends double jog commands on touch devices","- $G output emitted to UI when connected using grblHAL and manually sent","- Altmill profile updated $103 A steps to account for compiled microstepping","- SLB profiles updated with new values","- Updated defaults on Mk2, Mk1, and MillOne profiles","- AutoZero touch routine updated when running specific diameter bits to be more accurate, and retract distance on Z slightly increased for non-tip routines.","- Rotary toggle no longer updates values when cancelled on grblHAL.","- Changed Spindle/Laser toggle behaviour for when to use gSender settings vs EEPROM settings for laser offset and spindle/laser min and max.","- Custom theme visualizer background now saving correctly.","- Altmill profile now at top of profiles with other Sienci Machines","### 1.4.9 (August 5, 2024)","- Fix for time remaining converting timestamps incorrectly","- Firmware groups now always emitted to UI on connection","- Reduced situations where error 1 should appear on connection or homing","- Alterations to Altmill default profile for Z acceleration","- Enabling rotary mode for grblHAL now disables homing, and disabling rotary mode restores your previous homing value","- Updated Longmill HAL A axis travel resolution for compiled microstepping value","- Main window should no longer be focused on load file dialog","### 1.4.8 (July 11, 2024)","- Added Altmill profiles","- Start from line now also accounts for A axis if file contains those movements","- Fixed situation where progress bar could be greater than 100%","- Some time estimation alterations specifically when pausing jobs","- Fixed issue where console copy prompt stated limit other than 50","- Spindle delay on start is now a configurable value in ms","- Changes to ethernet behaviour to allow reconnection in more cases the board closes the connection early","- Maintenance tasks that are due now prompt the user to take care of them on application start","- Changed max value for spindle RPM in rotary surfacing tool","- Fix for rotary tab gaining focus and preventing keybinds from working","- Changes to console scrollbar size and sensitivity","- Setting A-axis zero now updates visualizer rotation correctly","- Homing enabled in diagnostics now correct for SLB","- A-axis DRO with $13 enabled now no longer converts incorrectly","- Relative Go To now correctly uses input values for all 3 axes","- Alarm 14 and 17 now reset and unlock instead of just unlock using UI buttons","- Firmware tool inputs now disabled in Alarm state","- Added preference for end of job modal to not appear","- Fixed crash on toggling lightweight mode","- End of probe code now correctly restore G90/G91 to previous state"]