["### 1.4.7 (April 30, 2024)","- Rapid position buttons work as expected with A-axis invert enabled","- Updated defaults for SLB homing speeds","- Added setting highlight and restore individual defaults to HAL firmware tool","- Fixed issue where SLB flashing could fail silently if connected before flashing","- Tweaks to finish time estimation","- Firmware flavour for SLB now included in diagnostic file","- Prevented soft reset on exiting check mode on SLB from getting the firmware not leaving check mode","- Alterations to behaviour of planning line in visualizer","- Go to button default values are now current position if absolute movement and 0 if relative movement","- Fixed issue where error would prevent the file from resuming in some situations","- GRBL controller now will always send $$ command eventually even if no startup message received","### 1.4.6 (April 5, 2024)","- Values properly convert in surfacing tool when swapping between metric and imperial preferred units","- Fixed default UI value precision when swapping between metric and imperial preferred units","- Handle error silently when checking for updates but no internet connection is available","- Added default profiles for all machines when connected using grblHAL and using the 'Restore Defaults' functionality","- No longer emit error 79 when connecting with e-stop enabled on SLB","- Fixed issue with soft limit Z jogging when trying to jog from machine limits","- Fixed status query mask when sending 0x87 complete status report vs ? partial status report to prevent alarm states from being slow to clear on UI","### 1.4.5 (March 28, 2024)","- Fix for jog shortcuts not sending short movement when quick pressed.","- GRBL firmware tool correctly updates values when list shortened with search term","- More rounding in tool changing values.","- Various updates to diagnostic PDF to include more at-a-glance information.","- HAL firmware categories loaded more consistently on connection","- HAL errors/alarms list populates more consistently on connection","- Renamed some firmware categories for clearer organization","- Better handling of cycle start, pause, and halt macro button functionalities","- Fixed choppiness in visualization in 4-axis mode.","- A-axis continuous jogging works as expected with soft limits enabled in 4-axis mode","- Feeder no longer pauses when setting EEPROM macro code block with a M0/M1 included.","- Rotary mode status correctly set on connection.","- Random errors no longer appear on connection","- Error log cleared on job start to prevent errors from not sending a job aren't included in the job error report.","- Adjust HAL jogging values","- Added ability to flash SLB already in DFU mode","- Flashing UX improvements for HAL"]