["### 1.1.7 (October 26th, 2022)","- Fix for XYZ probe profile when $13 enabled","- Fix for machine position overflowing bounds","- Fix for some keybinds no longer recognizing when they were released","### 1.1.6 (October 19th, 2022)","- Improved surfacing tool - pattern now ramps in to support more surfacing bit types, cut direction is reversible, able to start from center, can copy gcode to clipboard for saving.","- Major improvements to visualizer memory usage and parsing speed","- Start from line should account for maximum file Z height when moving into position to account for situations where Z0 is set at the spoilboard.","- Probe code should always return to exact starting location instead of approximating it.","- Improvements to firmware flashing UX - can now select profile and port inside tool.","- Fix for auto-probe code movements being too small when \"$13 report as inches\" EEPROM value enabled","- Go To buttons only use safe height if below that position when limit switches enabled to avoid moving downwards.","- Fixed values in some machine profiles.","- Added machine state guards to some keyboard shortcuts.","- UI Modals now more difficult to close accidentally.","- Bracket Comments on M0/M1 now emitted to UI.","- Laser offsets preferences allow negative values again","- Bounding Box variables once again available to macros","- Mac version now exits completely on close.","- Higher UI clarity when connecting to board with invalid/unrecognizable firmware","- Styling changes in Firmware Tool","- Fixed overflow when OS had screen zoom above 100%.","### 1.1.4 (August 26th, 2022)","* Fixed firmware tool control for setting $23","* Flashing again available without connecting to device","* Improvements to continuous jogging (thanks @cotepat)","* Fixed issue with some settings not properly persisting","* Outline tool improvements - moved to worker thread, G0 movements included, tweaks to accuracy","* More accurate file length estimates when connected - virtualizer now uses EEPROM acceleration values","* Probe function now available in manual tool change","* Better datafilter for invalid UTF8/UTF16 characters"]