["### 1.4.11 (December 16th)","- Added \"Skip Dialog\" option to code toolchange which combines both blocks and skips the \"Continue\" dialog","- Diagnostics now generates a zip file which includes the original diagnostic PDF, a copy of current gSender settings, and any loaded toolpath for better support.","- You are now able to update EEPROM values using the firmware tool when in Alarm state.","- Start from line now starts the spindle after the Z safe movement but before X and Y.","- Fix for A axis jog keybinds not working on standard GRBL controller.","- Reverted HAL changes $G using the realtime alternative to reduce instances of error 1 since it was not playing nicely with the new line parser.","- Fix for available axes and axes count not being emitted properly when disconnecting and reconnecting over ethernet.","- Auto Zero touch plate probing now properly converts bit diameter when using imperial preferred units and a specific bit size.","- Available ports are now case insensitive when matching known controller types (Thanks Dymk!)","- Macros no longer overflow the macro widget.","### 1.4.10 (October 28, 2024)","- Jog no longer sends double jog commands on touch devices","- $G output emitted to UI when connected using grblHAL and manually sent","- Altmill profile updated $103 A steps to account for compiled microstepping","- SLB profiles updated with new values","- Updated defaults on Mk2, Mk1, and MillOne profiles","- AutoZero touch routine updated when running specific diameter bits to be more accurate, and retract distance on Z slightly increased for non-tip routines.","- Rotary toggle no longer updates values when cancelled on grblHAL.","- Changed Spindle/Laser toggle behaviour for when to use gSender settings vs EEPROM settings for laser offset and spindle/laser min and max.","- Custom theme visualizer background now saving correctly.","- Altmill profile now at top of profiles with other Sienci Machines","### 1.4.9 (August 5, 2024)","- Fix for time remaining converting timestamps incorrectly","- Firmware groups now always emitted to UI on connection","- Reduced situations where error 1 should appear on connection or homing","- Alterations to Altmill default profile for Z acceleration","- Enabling rotary mode for grblHAL now disables homing, and disabling rotary mode restores your previous homing value","- Updated Longmill HAL A axis travel resolution for compiled microstepping value","- Main window should no longer be focused on load file dialog"]