[
  {
    "version": "1.5.5",
    "date": "September 24, 2025",
    "notes": [
      "New probe type, 3D Probe added, with future plans to support more than standard XYZ probing",
      "All probing cycles now sped up with reduced delays and reduced default retracts to 2mm",
      "Each probe block now has an individually customizable Z thickness",
      "AutoZero touch plate can now have it's thickness set",
      "All AutoZero probing now moves out of the way at the end to make removing the plate easier",
      "Longstanding excess probing movements now removed for speed, safety, and accuracy",
      "AutoZero bit diameter probing now offsetting correctly like in 1.4.11",
      "Tooltips re-added across the app for more hover information",
      "Spindle delay Config option for grbl machines now applies to Tool Change wizards and Start from line",
      "New behaviour where gSender will ignore M2 or M30 workspace reversion on job completion unless new Config option is toggled on. This should remove the need for using Automations to preserve workspaces.",
      "Machine state now handled if in Laser or Rotary mode and the tab is disabled",
      "Fixed safe height movements sometimes using the wrong units",
      "Fixed shortcuts that weren't acting as expected or weren't triggering",
      "Fixed toolchange wizard always going back to probe position before probing to allow movement for bit changes ahead of probing",
      "Fixed Config handling of Rotary forcing hard and soft limits for grbl machines",
      "UI styling tweaks, and adjustments to better accommodate smaller screens"
    ]
  },
  {
    "version": "1.5.4",
    "date": "August 27, 2025",
    "notes": [
      "Fix controller not instantiating correctly in some situations for grblHAL devices.",
      "Added some checks for soft limits on Z movements for application routines to limit alarming when outlining, probing, and tool changing.",
      "Visualizer grid sizing more accurately matches your machine size at 2X dimensions.",
      "Shortcut state handling adjusted for some binds to prevent them from working when they shouldn't.",
      "Shortcut order adjusted when configuring binds.",
      "Precise and Rapid toggle swapped in jog preset selector",
      "Start from line modal is now correct based on the file",
      "Copy button works on electron versions on Windows in remote mode dialog",
      "Rotary surfacing gcode generation adjusted to fix some cases of incorrect movements",
      "Various styling and copy adjustments."
    ]
  },
  {
    "version": "1.5.3",
    "date": "August 4, 2025",
    "notes": [
      "Outline runs if visualizer disabled in lightweight mode",
      "Added new config option for outline - can now run detailed (old routines, travels rough shape of toolpath) or square (the bounding box)",
      "Alterations to connection to make grbl detection more robust.  FluidNC should now catch as grbl.",
      "Fixed unit miscalculation on file stats",
      "Remote mode configuration made more robust to reduce situations where the app fails to start.",
      "Unit conversion fixes in squaring and calibration tools",
      "Stock turning and Probe rotary properly disable when in non-rotary mode",
      "Jog presets in config now reflect selected Carve screen units.",
      "Units again appear in config when connected to grbl board.",
      "Fixed load state issue when previous file was paused",
      "Corner selection in probing now persists between gSender sessions.",
      "Re-added the bad file and bad line detection with some improvements.  They should now appear in the Helper.",
      "Rename rotary install track length to appropriate value",
      "Stats connection summary formatted correctly for ethernet connection.",
      "Firmware settings imports now apply immediately on import.",
      "Gamepad profiles now represent the button name if known instead of just numbers.",
      "Visualizer grid now respects carve screen units.",
      "Visualizer colours now correct with Light visualizer theme.",
      "Spindle dropdown again reflects the current firmware spindle.",
      "AXS parsing should be more robust on grblHAL devices.",
      "Fixed edge cases in surfacing generation that could miss strip in center.",
      "Spindle/Laser toggle behaviour more closely matches 1.4.12 implementation.",
      "Z jogging popup re-added to calibration tools.",
      "Various config sorting and filtering changes.",
      "Load File area looks a little better in dark mode.",
      "Fixed cases where visualizer could go blank and not re-appear until toggling camera.",
      "Added spindle delay option to rotary surfacing tool.",
      "Plus and Minus buttons behaviour tweaks on jog feeds and distances",
      "Force Hard and Soft Limits config options type updated and no longer crash the application.",
      "Various look and feel and text changes."
    ]
  }
]