[
  {
    "version": "1.5.4",
    "date": "November 15, 2025",
    "notes": [
      "test"
    ]
  },
  {
    "version": "1.5.3",
    "date": "August 4, 2025",
    "notes": [
      "Outline runs if visualizer disabled in lightweight mode",
      "Added new config option for outline - can now run detailed (old routines, travels rough shape of toolpath) or square (the bounding box)",
      "Alterations to connection to make grbl detection more robust.  FluidNC should now catch as grbl.",
      "Fixed unit miscalculation on file stats",
      "Remote mode configuration made more robust to reduce situations where the app fails to start.",
      "Unit conversion fixes in squaring and calibration tools",
      "Stock turning and Probe rotary properly disable when in non-rotary mode",
      "Jog presets in config now reflect selected Carve screen units.",
      "Units again appear in config when connected to grbl board.",
      "Fixed load state issue when previous file was paused",
      "Corner selection in probing now persists between gSender sessions.",
      "Re-added the bad file and bad line detection with some improvements.  They should now appear in the Helper.",
      "Rename rotary install track length to appropriate value",
      "Stats connection summary formatted correctly for ethernet connection.",
      "Firmware settings imports now apply immediately on import.",
      "Gamepad profiles now represent the button name if known instead of just numbers.",
      "Visualizer grid now respects carve screen units.",
      "Visualizer colours now correct with Light visualizer theme.",
      "Spindle dropdown again reflects the current firmware spindle.",
      "AXS parsing should be more robust on grblHAL devices.",
      "Fixed edge cases in surfacing generation that could miss strip in center.",
      "Spindle/Laser toggle behaviour more closely matches 1.4.12 implementation.",
      "Z jogging popup re-added to calibration tools.",
      "Various config sorting and filtering changes.",
      "Load File area looks a little better in dark mode.",
      "Fixed cases where visualizer could go blank and not re-appear until toggling camera.",
      "Added spindle delay option to rotary surfacing tool.",
      "Plus and Minus buttons behaviour tweaks on jog feeds and distances",
      "Force Hard and Soft Limits config options type updated and no longer crash the application.",
      "Various look and feel and text changes."
    ]
  },
  {
    "version": "1.5.2",
    "date": "July 15, 2025",
    "notes": [
      "Fix issues with remote mode disconnecting main client and jobs stopping when connecting from remote mode",
      "Significantly sped up file loading and rendering on larger files",
      "Job end notifications will no longer appear if toggled off",
      "SVG visualization no longer teeny-tiny on inches postprocessor files",
      "Plus and Minus buttons returned to jog speeds with the prior existing logic",
      "AutoZero touchplate renamed to just AutoZero",
      "Added new Config option for Jog Delay, which configures how long a keypress/UI press/gamepad press before swapping to continuous jogging",
      "Commands sent later in connection cycle to reduce situations where Error 1 occurs when unlocking and resetting the board",
      "Generating a surfacing file no longer causes issues on main visualizer if not sent there",
      "Motors sections again will disappear from config when empty",
      "Restore defaults and default highlight works correctly in Config on settings considered hybrid between grbl/grblHAL",
      "Prevented situations where alarm list was not populating correctly",
      "Continuous jog without soft limits now sends more sane values when jogging in Inches across both controllers",
      "Load bar now appears correctly in surfacing and rotary surfacing tools",
      "Stopping a file that has an early M0 already sent will no longer pop up the pause modal",
      "Stock turning and Probe Rotary Z disabled for grbl controllers when in non-Rotary mode",
      "Config look and Feel tweaks",
      "Shortcuts rearranged so more commonly set ones are higher up",
      "File stat feed rates now convert correctly",
      "Zero All on grblHAL no longer sends Zero on A if A Axis not reported",
      "Various look and feel changes"
    ]
  }
]