[
  {
    "version": "1.5.5",
    "date": "September 24, 2025",
    "notes": [
      "Numerous styling and UX adjustments",
      "Auto Zero probe routine fixes for unit conversion",
      "Added new 3D probe routine, with customizable tip diameter in Config.",
      "Probe blocks now have individually customizable Z thicknesses",
      "Various general probe improvements",
      "Rapid position buttons correctly disable when not available",
      "Fixed toolchange wizard always goes back to probe position before probing to allow movement for bit changes ahead of probing.",
      "Spindle delay config option applies to tool change wizards and start from line.",
      "Various shortcut issues fixed.  Some shortcuts reordered based on usage.",
      "Added new config option to restore workspace when job finishes if M30 or M2 sent in file.",
      "Numerous tooltips added and updates across the UI."
    ]
  },
  {
    "version": "1.5.4",
    "date": "August 27, 2025",
    "notes": [
      "Fix controller not instantiating correctly in some situations for grblHAL devices.",
      "Added some checks for soft limits on Z movements for application routines to limit alarming when outlining, probing, and tool changing.",
      "Visualizer grid sizing more accurately matches your machine size at 2X dimensions.",
      "Shortcut state handling adjusted for some binds to prevent them from working when they shouldn't.",
      "Shortcut order adjusted when configurting binds.",
      "Precise and Rapid toggle swapped in jog preset selector",
      "Start from line modal is now correct based on the file",
      "Copy button works on electron versions on Windows in remote mode dialog",
      "Rotary surfacing gcode generation adjusted to fix some cases of incorrect movements",
      "Various styling and copy adjustments."
    ]
  },
  {
    "version": "1.5.3",
    "date": "August 4, 2025",
    "notes": [
      "Outline runs if visualizer disabled in lightweight mode",
      "Added new config option for outline - can now run detailed (old routines, travels rough shape of toolpath) or square (the bounding box)",
      "Alterations to connection to make grbl detection more robust.  FluidNC should now catch as grbl.",
      "Fixed unit miscalculation on file stats",
      "Remote mode configuration made more robust to reduce situations where the app fails to start.",
      "Unit conversion fixes in squaring and calibration tools",
      "Stock turning and Probe rotary properly disable when in non-rotary mode",
      "Jog presets in config now reflect selected Carve screen units.",
      "Units again appear in config when connected to grbl board.",
      "Fixed load state issue when previous file was paused",
      "Corner selection in probing now persists between gSender sessions.",
      "Re-added the bad file and bad line detection with some improvements.  They should now appear in the Helper.",
      "Rename rotary install track length to appropriate value",
      "Stats connection summary formatted correctly for ethernet connection.",
      "Firmware settings imports now apply immediately on import.",
      "Gamepad profiles now represent the button name if known instead of just numbers.",
      "Visualizer grid now respects carve screen units.",
      "Visualizer colours now correct with Light visualizer theme.",
      "Spindle dropdown again reflects the current firmware spindle.",
      "AXS parsing should be more robust on grblHAL devices.",
      "Fixed edge cases in surfacing generation that could miss strip in center.",
      "Spindle/Laser toggle behaviour more closely matches 1.4.12 implementation.",
      "Z jogging popup re-added to calibration tools.",
      "Various config sorting and filtering changes.",
      "Load File area looks a little better in dark mode.",
      "Fixed cases where visualizer could go blank and not re-appear until toggling camera.",
      "Added spindle delay option to rotary surfacing tool.",
      "Plus and Minus buttons behaviour tweaks on jog feeds and distances",
      "Force Hard and Soft Limits config options type updated and no longer crash the application.",
      "Various look and feel and text changes."
    ]
  }
]