[
  {
    "version": "1.5.7",
    "date": "January 8th, 2026",
    "notes": [
      "Fixed issue with start job shortcut not firing in some situations.",
      "Unlock button now has same logic as large Alarm unlock button for Alarm 10 and 17 where it will reset and unlock for you.",
      "Corner selection hidden for Z-only probe type",
      "Added support for Teensy boards in recognized devices",
      "Error line reporting mismatch fixed",
      "Stopping on start event codes should now correctly clear the planner and reset the board.",
      "Added cut depth validation to Surfacing tool",
      "Auto-reconnect should work for Ethernet again.",
      "Added import/export functionality for gamepad profiles",
      "Homing location now shows correctly on stats page",
      "Fixed issue with terminal history order",
      "Added new config option to run check on a file when it's loaded in.",
      "Fixed issue with rapid position shortcuts not memoizing positions",
      "GRBL spindle max/min again correctly updates the eeprom on change",
      "Config search behaviour updates to be more consistent with modified flag enabled."
    ]
  },
  {
    "version": "1.5.6",
    "date": "October 20th, 2025",
    "notes": [
      "Fixed issue with surfacing tool inputs not using latest input values when generating gcode",
      "Job stats update function altered to prevent situations where jobs would get lost when the array becomes too large",
      "Reverted removing early M6 commands",
      "Start job shortcut fixed to work on controllers for grblHAL devices",
      "Probe diameter cycle shortcut working again",
      "Updating values does not remove custom jog values on carve page",
      "Added way to change default units on remote view",
      "Bad file/invalid gcode checker will now run if the visualizer disabled in lightweight mode",
      "Various portrait mode look and feel changes",
      "Keyboard shortcut tool will no longer crash the UI if a keybind is configured but that feature then turned off",
      "Toasts can now have custom durations or disabled entirely (Thanks @Tecknickel-Dev)",
      "Future updates should again be appearing in-app when they become available."
    ]
  },
  {
    "version": "1.5.5",
    "date": "September 24, 2025",
    "notes": [
      "New probe type, 3D Probe added, with future plans to support more than standard XYZ probing",
      "All probing cycles now sped up with reduced delays and reduced default retracts to 2mm",
      "Each probe block now has an individually customizable Z thickness",
      "AutoZero touch plate can now have it's thickness set",
      "All AutoZero probing now moves out of the way at the end to make removing the plate easier",
      "Longstanding excess probing movements now removed for speed, safety, and accuracy",
      "AutoZero bit diameter probing now offsetting correctly like in 1.4.11",
      "Tooltips re-added across the app for more hover information",
      "Spindle delay Config option for grbl machines now applies to Tool Change wizards and Start from line",
      "New behaviour where gSender will ignore M2 or M30 workspace reversion on job completion unless new Config option is toggled on. This should remove the need for using Automations to preserve workspaces.",
      "Machine state now handled if in Laser or Rotary mode and the tab is disabled",
      "Fixed safe height movements sometimes using the wrong units",
      "Fixed shortcuts that weren't acting as expected or weren't triggering",
      "Fixed toolchange wizard always going back to probe position before probing to allow movement for bit changes ahead of probing",
      "Fixed Config handling of Rotary forcing hard and soft limits for grbl machines",
      "UI styling tweaks, and adjustments to better accommodate smaller screens"
    ]
  }
]